<template>
  <div class="rules">
		<div class="rules-list">
			<template v-for="(item, $index) in list">
			<div class="the-rules" :key="$index">{{item.tab}}</div>
			</template>
		</div>
		<div class="rules-content">

		</div>
	</div>
</template>

<script>
export default {
	data() {
		return {
			list: [
				{
					tab: '用户协议',
					title: '宅设会用户协议',
					time: '2020年02月27日',
					content: `<p>欢迎加入宅设会，我们将介绍用户在浏览，互动，分享时所要了解并遵守的条款。当你进入宅设会，成功注册，即成为宅设会的用户，这将被视为无条件接受该协议所有条款的内容。所以请于注册前仔细阅读以下条款。</p>
					<h5>使用条款</h5>
					<p>用户一旦注册成功，网站将保存用户的基本资料，包括 ID、昵称、密码、邮箱、手机号等信息。其中昵称为用户在本站展示的名称（或名字），用户对该昵称的合法性承担全部责任，不得使用国家法律法规禁止的词语，不得冒充他人，以他人名义发布信息；密码由用户自行设置并负责保管。用户对基本资料的操作所带来的后果以及法律责任，将由用户本人自行承担。 </p>
					<p>宅设会用户分为用户、作者、签约作者三种角色，各自有不同的权限和权利。</p>
					<p>用户可以在宅设会任何开放评论的文章中进行评论或回复，以及与任何开放私信的其他账户进行私信交流。评论、回复和私信交流时需遵守宅设的相关规定。</p>
					<p>用户应在国家法律法规的约束下理性交流，不得发布违法信息，宅设会将对以下信息进行删除：</p>
					<p>反对宪法所确定的基本原则的；</p>
					<p>危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； </p>
					<p>损害国家荣誉和利益的； 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
					<p>破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
					<p>散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
					<p>散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
					<p>侮辱或者诽谤他人，侵害他人合法权益的；</p>
					<p>含有法律、行政法规禁止的其他内容的。 </p>
					<p>用户、作者、签约作者不得发布有悖社会公德、违反知识产权等信息，如有涉及，少数派有权进行屏蔽或删除。如情节严重，少数派有权对该用户、作者、签约作者作禁言处理。 </p>
					<h5>知识产权</h5>
					<p>少数派是一个关于数字产品、数码硬件、自我管理、生活方式、效率提升等相关工具的推荐和经验分享互动平台，强调并保护用户的知识产权。用户、作者、签约作者在少数派发布的内容，包括文章、专栏、评论、回复评论、私信等，著作权均属用户所有。</p>
					<p>用户、作者、签约作者在少数派发布的内容，包括文章、专栏、评论、回复评论、私信等，少数派有权在本站（sspai.com）以及少数派旗下应用（App）中进行署名转载和引用，但在与用户、作者、签约作者协商或签署额外协议之前，少数派不会在本站或第三方平台做商业目的使用。</p>
					<p>我们尊重知识产权，签署成为签约作者时会共同约定稿酬，对签约作者投稿在本站平台与合作平台内容的传播均为有偿。在其他商业使用的场景，将与著作权本人（用户、作者、签约作者）具体沟通额外报酬或分成。</p>
					<p>对于签约作者发布到少数派首页的文章，我们在发布和传播时会在文章末尾标明，未经宅设会许可授权，不能进行转载使用。 </p>`
				},{
					tab: '隐私保护',
					title: '宅设会隐私保护',
					time: '2020年02月27日',
					content: ``
				},{
					tab: '联系我们',
					title: '联系我们',
					time: '2020年02月27日',
					content: ``
				}
			],
		}
	},
}
</script>